---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightDistribution.Dispose
source: html/5a2007d2-79ab-57fb-0975-10b7329b9b1c.htm
---
# Autodesk.Revit.DB.Lighting.LightDistribution.Dispose Method

Releases all resources used by the LightDistribution

## Syntax (C#)
```csharp
public void Dispose()
```